data/archive/read_write_split_enable_14_with_read_pct_20/test-mysql-run-20-80-225-time-2023-08-23-09-14.txt
run sysbench
check mysql database exists
mysql host 172.16.134.200 connect success!
database mydb exists
/usr/bin/sysbench
cd ./sysbench/src/lua;sysbench --db-driver=mysql --mysql-host=172.16.134.200 --mysql-port=3306 --mysql-user=root --mysql-password=sf2gxx9r --mysql-db=mydb --table_size=2000000 --tables=50 --time=60 --threads=225 --events=0 --percentile=99 --read-percent=20 --write-percent=80 --skip_trx=on --mysql-ignore-errors=1062 --db-ps-mode=disable --report-interval=1 oltp_read_write_pct run
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 225
Report intermediate results every 1 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 1s ] thds: 225 tps: 0.00 qps: 9552.27 (r/w/o: 4493.54/5058.73/0.00) lat (ms,99%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 2s ] thds: 225 tps: 0.00 qps: 7248.56 (r/w/o: 0.00/7248.56/0.00) lat (ms,99%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 3s ] thds: 225 tps: 115.00 qps: 7150.07 (r/w/o: 1680.02/5470.05/0.00) lat (ms,99%): 2985.89 err/s: 0.00 reconn/s: 0.00
[ 4s ] thds: 225 tps: 110.00 qps: 6301.99 (r/w/o: 2820.00/3482.00/0.00) lat (ms,99%): 3574.99 err/s: 0.00 reconn/s: 0.00
[ 5s ] thds: 225 tps: 0.00 qps: 3656.03 (r/w/o: 0.00/3656.03/0.00) lat (ms,99%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 6s ] thds: 225 tps: 0.00 qps: 4782.93 (r/w/o: 0.00/4782.93/0.00) lat (ms,99%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 7s ] thds: 225 tps: 3.00 qps: 4005.05 (r/w/o: 57.00/3948.05/0.00) lat (ms,99%): 4437.27 err/s: 0.00 reconn/s: 0.00
[ 8s ] thds: 225 tps: 191.00 qps: 6947.94 (r/w/o: 3723.97/3223.97/0.00) lat (ms,99%): 5124.81 err/s: 0.00 reconn/s: 0.00
[ 9s ] thds: 225 tps: 31.00 qps: 5312.03 (r/w/o: 719.00/4593.03/0.00) lat (ms,99%): 5312.73 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 225 tps: 0.00 qps: 4728.02 (r/w/o: 0.00/4728.02/0.00) lat (ms,99%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 11s ] thds: 225 tps: 0.00 qps: 4244.00 (r/w/o: 0.00/4244.00/0.00) lat (ms,99%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 12s ] thds: 225 tps: 149.00 qps: 6566.93 (r/w/o: 2947.97/3618.96/0.00) lat (ms,99%): 4683.57 err/s: 0.00 reconn/s: 0.00
[ 13s ] thds: 225 tps: 75.00 qps: 5188.01 (r/w/o: 1532.00/3656.01/0.00) lat (ms,99%): 4683.57 err/s: 0.00 reconn/s: 0.00
[ 14s ] thds: 225 tps: 1.00 qps: 4604.04 (r/w/o: 20.00/4584.04/0.00) lat (ms,99%): 4768.67 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 225 tps: 0.00 qps: 4259.00 (r/w/o: 0.00/4259.00/0.00) lat (ms,99%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 16s ] thds: 225 tps: 71.00 qps: 5686.90 (r/w/o: 1192.98/4493.92/0.00) lat (ms,99%): 4683.57 err/s: 0.00 reconn/s: 0.00
[ 17s ] thds: 225 tps: 144.00 qps: 6737.04 (r/w/o: 3027.02/3710.02/0.00) lat (ms,99%): 4943.53 err/s: 0.00 reconn/s: 0.00
[ 18s ] thds: 225 tps: 10.00 qps: 4625.04 (r/w/o: 280.00/4345.04/0.00) lat (ms,99%): 4599.99 err/s: 0.00 reconn/s: 0.00
[ 19s ] thds: 225 tps: 0.00 qps: 3844.01 (r/w/o: 0.00/3844.01/0.00) lat (ms,99%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 225 tps: 6.00 qps: 4141.99 (r/w/o: 105.00/4036.99/0.00) lat (ms,99%): 4280.32 err/s: 0.00 reconn/s: 0.00
[ 21s ] thds: 225 tps: 180.00 qps: 7603.87 (r/w/o: 3419.94/4183.93/0.00) lat (ms,99%): 4943.53 err/s: 0.00 reconn/s: 0.00
[ 22s ] thds: 225 tps: 39.00 qps: 5728.04 (r/w/o: 975.01/4753.03/0.00) lat (ms,99%): 4768.67 err/s: 0.00 reconn/s: 0.00
[ 23s ] thds: 225 tps: 0.00 qps: 5087.06 (r/w/o: 0.00/5087.06/0.00) lat (ms,99%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 24s ] thds: 225 tps: 27.00 qps: 5125.00 (r/w/o: 346.00/4779.00/0.00) lat (ms,99%): 4055.23 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 225 tps: 154.92 qps: 6547.52 (r/w/o: 3065.37/3482.15/0.00) lat (ms,99%): 4599.99 err/s: 0.00 reconn/s: 0.00
[ 26s ] thds: 225 tps: 42.02 qps: 5276.76 (r/w/o: 1055.55/4221.21/0.00) lat (ms,99%): 4358.09 err/s: 0.00 reconn/s: 0.00
[ 27s ] thds: 225 tps: 1.00 qps: 4539.04 (r/w/o: 32.00/4507.04/0.00) lat (ms,99%): 4280.32 err/s: 0.00 reconn/s: 0.00
[ 28s ] thds: 225 tps: 14.00 qps: 4863.99 (r/w/o: 203.00/4660.99/0.00) lat (ms,99%): 4280.32 err/s: 0.00 reconn/s: 0.00
[ 29s ] thds: 225 tps: 110.00 qps: 5240.96 (r/w/o: 2247.98/2992.98/0.00) lat (ms,99%): 4683.57 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 225 tps: 90.00 qps: 5705.01 (r/w/o: 1735.00/3970.01/0.00) lat (ms,99%): 4855.31 err/s: 0.00 reconn/s: 0.00
[ 31s ] thds: 225 tps: 11.00 qps: 5895.03 (r/w/o: 314.00/5581.03/0.00) lat (ms,99%): 4943.53 err/s: 0.00 reconn/s: 0.00
[ 32s ] thds: 225 tps: 4.00 qps: 3842.02 (r/w/o: 80.00/3762.02/0.00) lat (ms,99%): 4437.27 err/s: 0.00 reconn/s: 0.00
[ 33s ] thds: 225 tps: 118.00 qps: 6875.92 (r/w/o: 2145.97/4729.94/0.00) lat (ms,99%): 4599.99 err/s: 0.00 reconn/s: 0.00
[ 34s ] thds: 225 tps: 91.00 qps: 5980.01 (r/w/o: 1999.00/3981.01/0.00) lat (ms,99%): 4599.99 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 225 tps: 12.00 qps: 4824.03 (r/w/o: 275.00/4549.03/0.00) lat (ms,99%): 4358.09 err/s: 0.00 reconn/s: 0.00
[ 36s ] thds: 225 tps: 3.00 qps: 4542.02 (r/w/o: 52.00/4490.02/0.00) lat (ms,99%): 4128.91 err/s: 0.00 reconn/s: 0.00
[ 37s ] thds: 225 tps: 95.00 qps: 6061.89 (r/w/o: 1636.97/4424.92/0.00) lat (ms,99%): 4437.27 err/s: 0.00 reconn/s: 0.00
[ 38s ] thds: 225 tps: 107.00 qps: 6352.02 (r/w/o: 2405.01/3947.01/0.00) lat (ms,99%): 4517.90 err/s: 0.00 reconn/s: 0.00
[ 39s ] thds: 225 tps: 20.00 qps: 4607.04 (r/w/o: 406.00/4201.04/0.00) lat (ms,99%): 4517.90 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 225 tps: 4.00 qps: 5103.99 (r/w/o: 61.00/5042.99/0.00) lat (ms,99%): 4128.91 err/s: 0.00 reconn/s: 0.00
[ 41s ] thds: 225 tps: 64.00 qps: 5064.98 (r/w/o: 1039.00/4025.99/0.00) lat (ms,99%): 4358.09 err/s: 0.00 reconn/s: 0.00
[ 42s ] thds: 225 tps: 123.00 qps: 6521.96 (r/w/o: 2627.98/3893.98/0.00) lat (ms,99%): 4683.57 err/s: 0.00 reconn/s: 0.00
[ 43s ] thds: 225 tps: 34.00 qps: 4744.06 (r/w/o: 739.01/4005.05/0.00) lat (ms,99%): 4683.57 err/s: 0.00 reconn/s: 0.00
[ 44s ] thds: 225 tps: 1.00 qps: 4229.99 (r/w/o: 35.00/4194.99/0.00) lat (ms,99%): 4437.27 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 225 tps: 35.00 qps: 5471.98 (r/w/o: 567.00/4904.98/0.00) lat (ms,99%): 4599.99 err/s: 0.00 reconn/s: 0.00
[ 46s ] thds: 225 tps: 133.00 qps: 6620.99 (r/w/o: 2741.00/3879.99/0.00) lat (ms,99%): 4768.67 err/s: 0.00 reconn/s: 0.00
[ 47s ] thds: 225 tps: 54.00 qps: 6061.00 (r/w/o: 1150.00/4911.00/0.00) lat (ms,99%): 4517.90 err/s: 0.00 reconn/s: 0.00
[ 48s ] thds: 225 tps: 3.00 qps: 4363.03 (r/w/o: 60.00/4303.03/0.00) lat (ms,99%): 4437.27 err/s: 0.00 reconn/s: 0.00
[ 49s ] thds: 225 tps: 33.00 qps: 5403.98 (r/w/o: 513.00/4890.99/0.00) lat (ms,99%): 4203.93 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 225 tps: 112.00 qps: 5534.99 (r/w/o: 2294.00/3240.99/0.00) lat (ms,99%): 4437.27 err/s: 0.00 reconn/s: 0.00
[ 51s ] thds: 225 tps: 75.00 qps: 5551.01 (r/w/o: 1548.00/4003.01/0.00) lat (ms,99%): 4437.27 err/s: 0.00 reconn/s: 0.00
[ 52s ] thds: 225 tps: 3.00 qps: 3897.02 (r/w/o: 105.00/3792.02/0.00) lat (ms,99%): 4517.90 err/s: 0.00 reconn/s: 0.00
[ 53s ] thds: 225 tps: 10.00 qps: 4836.92 (r/w/o: 181.00/4655.92/0.00) lat (ms,99%): 4683.57 err/s: 0.00 reconn/s: 0.00
[ 54s ] thds: 225 tps: 96.00 qps: 6039.06 (r/w/o: 1815.02/4224.04/0.00) lat (ms,99%): 4943.53 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 225 tps: 110.00 qps: 6881.97 (r/w/o: 2240.99/4640.98/0.00) lat (ms,99%): 4768.67 err/s: 0.00 reconn/s: 0.00
[ 56s ] thds: 225 tps: 9.00 qps: 5075.05 (r/w/o: 263.00/4812.05/0.00) lat (ms,99%): 4599.99 err/s: 0.00 reconn/s: 0.00
[ 57s ] thds: 225 tps: 7.00 qps: 3897.00 (r/w/o: 121.00/3776.00/0.00) lat (ms,99%): 4203.93 err/s: 0.00 reconn/s: 0.00
[ 58s ] thds: 225 tps: 60.00 qps: 4998.99 (r/w/o: 1176.00/3822.99/0.00) lat (ms,99%): 4437.27 err/s: 0.00 reconn/s: 0.00
[ 59s ] thds: 225 tps: 134.00 qps: 7023.96 (r/w/o: 2608.99/4414.97/0.00) lat (ms,99%): 4683.57 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 225 tps: 23.00 qps: 4743.04 (r/w/o: 574.01/4169.04/0.00) lat (ms,99%): 4599.99 err/s: 0.00 reconn/s: 0.00
[ 61s ] thds: 225 tps: 4.00 qps: 4518.01 (r/w/o: 0.00/4518.01/0.00) lat (ms,99%): 4517.90 err/s: 0.00 reconn/s: 0.00
[ 62s ] thds: 225 tps: 57.00 qps: 4210.95 (r/w/o: 0.00/4210.95/0.00) lat (ms,99%): 4517.90 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            67460
        write:                           269840
        other:                           0
        total:                           337300
    transactions:                        3373   (53.85 per sec.)
    queries:                             337300 (5384.50 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          62.6413s
    total number of events:              3373

Latency (ms):
         min:                                 2480.56
         avg:                                 4142.32
         max:                                 5351.98
         99th percentile:                     4943.53
         sum:                             13972030.44

Threads fairness:
    events (avg/stddev):           14.9911/0.09
    execution time (avg/stddev):   62.0979/0.41